{"id":"32159","cancellationPolicies":[{"label":"Deposit Only rates","description":"This property has a 2 day cancellation policy. Failure to cancel within this time will result in a cancellation charge equal to the first night of your stay, unless otherwise stated (see 'Things to Note' information)."}],"depositPercentage":15,"rooms":{"dorms":[],"privates":[]},"specialEventConditions":{"title":"Christmas and New Year","description":"No arrival departures Christmas or Boxing Day (25 & 26) and no arrival/departure 31st December or 1st January\r\n\r\nRules of NEW YEARS include:\r\n-Minimum of 4 nights over New Years\r\n-No check ins or outs on the 31st December or the 1st January\r\n-The first night will be charged at time of booking. \r\n-This is fully refundable up until 5 days before arrival date.\r\n\r\nPlease note we are a Dry Hostel from the 27th December - January 5th . All Alcohol will be confiscated and returned when you depart.\r\n\r\nNo Groups over 6 people.\r\n\r\nOver New Years all guests must be 20 years or over - ID will be checked (Management has the right to refuse stay if any guests are unable to provide ID )\r\n\r\nIf any of the above rules are broken or disrespected you will be immediately be removed/evicted from the hostel and full loss of payment."},"freeCancellation":{"label":"Free Cancellation rates","description":"If you cancel your booking before 23:59 23rd Dec 2025 (NZDT) your deposit will be refunded to your payment card. If you cancel after 23:59 23rd Dec 2025 (NZDT) or in the event of a no-show, your deposit will not be refunded and the total of the first night's accommodation will be charged to your payment card, unless otherwise stated (see 'Things to Note' information). Please note that cancellations must be made directly within your booking in My Account."},"lowestPricePerNight":null,"lowestPrivatePricePerNight":null,"lowestDormPricePerNight":null,"lowestAveragePricePerNight":null,"lowestAverageDormPricePerNight":null,"lowestAveragePrivatePricePerNight":null,"freeCancellationAvailable":false,"freeCancellationAvailableUntil":"2025-12-23T10:59:59+00:00","promotions":[],"margins":[{"date":"2025-12-26","total":"15.0","contractual":"15.0"}],"vat":0}
